/*
//概念补充
1.流数据是一组顺序、大量、快速、连续到达的数据序列,一般情况下,
数据流可被视为一个随时间延续而无限增长的动态数据集合。
应用于网络监控、传感器网络、航空航天、气象测控和金融服务等领域。
流数据是指由数千个数据源持续生成的数据，通常也同时以数据记录的形式发送，
规模较小（约几千字节）。流数据包括多种数据，
例如客户使用您的移动或 Web 应用程序生成的日志文件、网购数据、
游戏内玩家活动、社交网站信息、金融交易大厅或地理空间服务，
以及来自数据中心内所连接设备或仪器的遥测数据。
此类数据需要按记录或根据滑动时间窗口按顺序进行递增式处理，
可用于多种分析，包括关联、聚合、筛选和取样。借助此类分析得出的信息，
公司得以深入了解其业务和客户活动的方方面面，例如服务使用情况（用于计量/计费）、
服务器活动、网站点击量以及设备、人员和实物的地理位置，从而迅速对新情况做出响应。
例如，公司可以持续分析社交媒体流，从而跟踪公众对其品牌和产品的看法的变化，
并在必要时及时做出反应。 
2.流（stream）是一种在 Node.js 中处理流式数据的抽象接口。 
stream 模块提供了一些基础的 API，用于构建实现了流接口的对象。*/